# Chapter 8

### This chapter focuses on tools to combine, join, and rearrange data across a # of files or databases

## 8.1 Hierarchical Indexing

In [1]:
# hierarchical indexing is a pandas feature that allows you to have multiple (2 or more) index levels on an axis

In [3]:
data = pd.Series(np.random.randn(9), 
                index = [['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1    0.484195
   2    1.102046
   3   -0.363721
b  1    0.488622
   3    0.348273
c  1   -0.284559
   2   -0.686733
d  2   -0.608764
   3   -0.715309
dtype: float64

In [5]:
# this is a series with 'MultiIndex' as its index

In [6]:
data.index

# 3 'as' fit with the secondary index of [1, 2, 3], 2 'bs' fit with [1, 3], 2 'cs' fit with [1, 2], 2 d's fit w/ [2, 3]

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
# hierarchical indexed obj allow 'partial' indexing
# this allows you to concisely seleect subsets of the data

In [8]:
data['b']

1    0.488622
3    0.348273
dtype: float64

In [9]:
data['b': 'c']

# this is inclusive

b  1    0.488622
   3    0.348273
c  1   -0.284559
   2   -0.686733
dtype: float64

In [10]:
data.loc[['b', 'd']]

b  1    0.488622
   3    0.348273
d  2   -0.608764
   3   -0.715309
dtype: float64

In [11]:
# selection can also be done from an inner level

# inner level would be the index closest to the actual values, outer level would be the one to the left (or above)
# the closest 

# looking at the entire data set, if any index values are == to 2, return that value

In [12]:
data.loc[:, 2]

a    1.102046
c   -0.686733
d   -0.608764
dtype: float64

In [13]:
# hiearchical indexing plays a role in reshaping data and group based operations like forming a pivot table

# can rearrange the data into a df using 'unstack'

# turns a series in a df

In [14]:
data.unstack()

          1         2         3
a  0.484195  1.102046 -0.363721
b  0.488622       NaN  0.348273
c -0.284559 -0.686733       NaN
d       NaN -0.608764 -0.715309

In [15]:
# the inverse of 'unstack' is 'stack'

# get it, stack cause stack is a series

In [16]:
data.unstack().stack()

a  1    0.484195
   2    1.102046
   3   -0.363721
b  1    0.488622
   3    0.348273
c  1   -0.284559
   2   -0.686733
d  2   -0.608764
   3   -0.715309
dtype: float64

In [17]:
# in a df, either axis can have an hiearchicacal index

In [270]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns = [['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])

In [271]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [272]:
# hierarchical levels can have names (strs or python ojb)
# these will show in console output

In [273]:
frame.index.names = ['key1', 'key2']

In [274]:
frame.columns.names = ['state', 'color']

In [275]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [276]:
# with partial column indexing, you can select groups of columns

In [277]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [278]:
# 'MultiIndex' can be created and then reused, the columns in the preceeding df with level names
# could be created like this

In [279]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                          ['Green', 'Red', 'Green']],
                         names = ['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

## Reordering and Sorting Levels

In [280]:
# say you want to reorder the levels on an axis or sort the data by the values in one specific level

# 'swaplevel' takes 2 level numbers or names and returns a new obj with the levels interchanged
# the data is otherwise unaltered

In [281]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [282]:
# look above, key1 and key 2 swapped

In [283]:
# 'sort_index' sorts data using only the values in a single level

In [285]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [33]:
# oh it looks like it sorts based on grouping and you tell which level of index to look at
# level 1 refers to key2 which is in the 1th index

In [287]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['key1', 'key2'])

In [298]:
frame.swaplevel(0,1).sort_index(level = 1)

# oh in this example, we pick level which is 1 (in swap level), which is key1 and then it's sorted with a, a, b, b

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [35]:
# data selection is better on hierachical indexed obj if the index is lexicographically sorted starting with the 
# outermost level, the result of calling sort_index(level = 0), or sort_index()

## Sumary Statistics by Level

In [36]:
# you can specify the level you want to aggregate a statistics measure on by a specific axis

In [37]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [38]:
frame.sum(level = 'color', axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Indexing with a DataFrame's columns

In [39]:
# not weird to use one or more columns from a df as the row index
# or you move the row index into the df's columns

In [40]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1), 
                     'c': ['one', 'one' , 'one', 'two', 'two', 'two', 'two'],
                     'd': [0, 1, 2, 0, 1, 2, 3]})

In [41]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [42]:
# df.set_index will create a new df using one or more of its columns as the index

In [43]:
frame2 = frame.set_index(['c', 'd'])

In [44]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [45]:
# by default the columns are removed from the df, but you can leave them in with 'drop = False'

In [46]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [47]:
# 'reset_index' does the opposite of set_index, the hierachical index levels are moved into the columns

In [49]:
frame2.reset_index()

# 'c' and 'd' become columns again

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2 Combining and Merging Datasets

In [51]:
# data in pd obj can be combined w/

# pandasmerge - connects rows in a df based on one or more keys, is a db.join op

# pandas.concat - concats/stacks obj along an axis

# combine_first - enables splicing together overlapping data to fill in missing values in one obj from another

## Database-Style DataFrame Joins

In [52]:
# 'merge' or 'join' operations combine datasets by lining rows using 1 or more keys

In [53]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1': range(7)})

In [58]:
df2 = pd.DataFrame({'key':['a', 'b', 'd'],
                  'data2': range(3)})

In [59]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [60]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [61]:
# this example is a 'many-to-one' join

# there's 3 'bs' in the key from df1 so every 'b' gets a 1, and every 'a' gets a 0. And cause this is an inner
# join, d does not show up

# it's important you specify which column name you wish to merge on, otherwise merge uses the overlapping
# column names as keys

In [63]:
pd.merge(df1, df2, on ='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [64]:
# if column names are different in each obj, you can specify them separately

In [69]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1': range(7)})

df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [70]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                   'data2': range(3)})

df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [67]:
pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [71]:
# this looks like a side by side concat where you can tell which df is ont he left and which is on the right

# so df3 has all its values, but because there's only 1 b in df4, all values that are assigned to b are given the 
# the value of 1, which corresponds to b in df4

In [72]:
# 'c' and 'd' values are missing from the result casue this is an inner join

# can also use 'left', 'right', and 'outer' join

# outer join includes everything

In [73]:
pd.merge(df1, df2, how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [74]:
# many-to-many merges have well defned but not intuitive behavior

In [76]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [77]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                   'data2': range(5)})

In [78]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [79]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [80]:
pd.merge(df1, df2, on = 'key', how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [81]:
# many to many joins form the 'Cartesian' product of rows

# since there were three 'b' rows in the left df and 2 in the right one, there are six 'b' rows in the result

In [82]:
pd.merge(df1, df2, how = 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [83]:
# to merge wtih multiple keys, pass a list of column names

In [88]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                    'key2': ['one', 'two', 'three'],
                    'lval': [1, 2, 3]})

In [92]:
left

  key1   key2  lval
0  foo    one     1
1  foo    two     2
2  bar  three     3

In [89]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                     'key2': ['one', 'one', 'one', 'two'],
                     'rval': [4, 5, 6, 7]})

In [93]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [90]:
pd.merge(left, right, on = ['key1', 'key2'], how = 'outer')

  key1   key2  lval  rval
0  foo    one   1.0   4.0
1  foo    one   1.0   5.0
2  foo    two   2.0   NaN
3  bar  three   3.0   NaN
4  bar    one   NaN   6.0
5  bar    two   NaN   7.0

In [94]:
# to determine which key combinations will appear in a result, think of the multiple keys as forming an arr of tuples
# to be used as a single join key

In [95]:
# another thing is to consider overlapping column names

In [96]:
# merge has a 'suffxixes' option for specifying strings toapend to overlapping names in the left and right df obj

In [97]:
pd.merge(left, right, on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar  three     3    one     6
5  bar  three     3    two     7

In [98]:
pd.merge(left, right, on = 'key1', suffixes = ('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar     three     3        one     6
5  bar     three     3        two     7

## Merging on Index

In [99]:
# some cases merge keys in df will be found in index, in this case you pass left_index = True or right_index = True
# or both to indicate that the index should be used as the merge key

In [100]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                     'value': range(6)})

In [101]:
right1 = pd.DataFrame({'grou_val': [3.5, 7]}, index = ['a', 'b'])

In [102]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [103]:
right1

   grou_val
a       3.5
b       7.0

In [104]:
pd.merge(left1, right1, left_on = 'key', right_index = True)

# every a in there is assigned a 3.5, every b a 7.0

#

  key  value  grou_val
0   a      0       3.5
2   a      2       3.5
3   a      3       3.5
1   b      1       7.0
4   b      4       7.0

In [110]:
pd.merge(left1, right1, left_on = 'key', right_index = True)

# left1 is the first df
# right1 is the second df
# left_on = 'key' - from left1, chooses the key column as the index to join on 
# right_index - right_index just says the right_index joins based on left_on
# left_on and right_index are saying the indexes are what the join is based on

  key  value  grou_val
0   a      0       3.5
2   a      2       3.5
3   a      3       3.5
1   b      1       7.0
4   b      4       7.0

In [111]:
# the default of a merge is to intersect the join keys
# you can fnorm the union of them with an outer join

In [112]:
pd.merge(left1, right1, left_on = 'key', right_index = True, how = 'outer')

# df is joined on left1's 'key' as the key, right_index's 'key' is joined on 'left_1's key, 
# this is an outer_join because it includes everything from left1, and right1

  key  value  grou_val
0   a      0       3.5
2   a      2       3.5
3   a      3       3.5
1   b      1       7.0
4   b      4       7.0
5   c      5       NaN

In [113]:
# hiearchical indexed data merge

# joining on index is a multiple key merge

In [118]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                     'key2': [2000, 2001, 2002, 2001, 2002],
                     'data': np.arange(5.)})

In [119]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                     index = [['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                              [2001, 2000, 2000, 2000, 2001, 2002]],
                     columns = ['event1', 'event2'])

In [120]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [121]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [122]:
# in this case, you have to indicate multiple columns to merge on as a list

# we handle duplicate index values with how = 'outer'

In [125]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'], right_index = True)

# 'how' defaults to 'inner'

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [126]:
# ugh there's 1 ohio 2000 in lefth, but 2 ohio 2000s in righth
# when we merge, the two ohio 2000s each get a 1 

# i don't fully get this

In [127]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'],
        right_index = True, how = 'outer')

# get everything

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [128]:
# can also use the indexes of both sides of the merge

In [129]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                    index = ['a', 'c', 'e'],
                    columns = ['Ohio', 'Nevada'])

In [132]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
            index = ['b', 'c', 'd', 'e'],
            columns = ['Missouri', 'Alabama'])

In [131]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [133]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [134]:
pd.merge(left2, right2, how = 'outer', left_index = True, right_index = True)

# left_index and right_index tell you which indexes to merge on, when both set to True, we merge both indexes based
# on that value

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [135]:
# df also has a 'join' instance for merging by index
# can combine many df obj having the same or similar indexes but non overlapping columns

In [136]:
left2.join(right2, how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [137]:
# however using a df's 'join' method performs a left join

In [138]:
left1.join(right1, on = 'key')

  key  value  grou_val
0   a      0       3.5
1   b      1       7.0
2   a      2       3.5
3   a      3       3.5
4   b      4       7.0
5   c      5       NaN

In [139]:
# for index-on-index merges, you can pass a list of df to 'join' as an alternative to using the more general 'concat'

In [140]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                      index = ['a', 'c', 'e', 'f'],
                      columns = ['New York', 'Oregon'])

In [141]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [143]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [144]:
left2.join([right2, another], how = 'outer')

# remember joins are based on the keys!!

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

## Concatenating Along an Axis

In [145]:
# concatenating, binding, or stacking (all the same)
# np's 'concatenate' function can do this with np arr's

In [148]:
arr = np.arange(12).reshape((3,4))

In [149]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [150]:
np.concatenate([arr, arr], axis = 1)

# concatenate based on indexes

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [151]:
# labeled axex enable you to further generalize array concatenation

# stuff like:

# if some obj are indexed differently on the other axes, should we combine the distinct elemnets in these axes
# or use only the shared values

# do teh concatenated chunks of data need to be cidentifaible

# does the 'concatenation axis' contain data that needs to be conserved
# in many cases, the default int labels in a df are best discarded during concatenation

In [152]:
# suppose we have three Series with no INDEX overlap

In [163]:
s1 = pd.Series([0, 1], index = ['a', 'b'])
s1

a    0
b    1
dtype: int64

In [166]:
s2 = pd.Series([2, 3, 4], index = ['c', 'd', 'e'])

In [167]:
s3 = pd.Series([5, 6], index = ['f', 'g'])
s2

c    2
d    3
e    4
dtype: int64

In [168]:
# by default concat works along axis = 0, producing another Series
# if you pass axis = 1, the result will be a df

In [169]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [170]:
pd.concat([s1, s2, s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [171]:
# there is no overalp on the other axis, whcihc you can see is the sorted union
# the outer join of the indexes, you can instersect them by passing join = 'inner'

In [173]:
s4 = pd.concat([s1, s3])

In [174]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [175]:
pd.concat([s1, s4], axis = 1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [176]:
pd.concat([s1, s4], axis = 1, join = 'inner')

# 'f' and 'g' labels dissappeared because of the join = 'inner'

   0  1
a  0  0
b  1  1

In [177]:
s1

a    0
b    1
dtype: int64

In [178]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [179]:
# you can specify the axes to be used on the other axes with join_axes

In [181]:
pd.concat([s1, s4], axis = 1, join_axes = [['a', 'c', 'b', 'e']])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [182]:
# sometimes concatenated pieces are not idenitfiiable in the result
# so use a hierachical index on the concat xis

In [183]:
result = pd.concat([s1, s1, s3], keys = ['one', 'two', 'three'])

In [184]:
result

# for each series passed in, give it a key

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [185]:
# in the case of combining SSeries along axis. 1, the 'keys' become df column headers:

In [186]:
pd.concat([s1, s2, s3], axis = 1, keys = ['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [187]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index = ['a', 'b', 'c'],
                  columns = ['one', 'two'])

In [189]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index = ['a', 'c'],
                  columns = ['three', 'four'])

In [192]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [193]:
df2

   three  four
a      5     6
c      7     8

In [194]:
pd.concat([df1, df2], axis = 1, keys = ['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [195]:
# if you pass a dict of obj instead of a list, the dict's keys will be used for the keys options

In [196]:
pd.concat({'level1': df1, 'level2': df2}, axis = 1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [197]:
# you can also create axis levels with 'names'

In [198]:
pd.concat([df1, df2], axis = 1, keys = ['level1', 'level2'],
         names = ['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [199]:
# and lastly consider if a df where the row index does not contain any relevant data

In [200]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns = ['a', 'b', 'c', 'd'])

In [201]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns = ['b', 'd', 'a'])

In [202]:
df1

          a         b         c         d
0 -0.109095  1.095060 -0.094139  1.868008
1 -0.076989  1.650014  1.059093 -0.192418
2  0.728413 -1.490116  2.078724  0.264482

In [203]:
df2

          b         d         a
0 -0.496911  0.410460 -1.611903
1  0.671499  0.350244  1.202061

In [204]:
pd.concat([df1, df2])

          a         b         c         d
0 -0.109095  1.095060 -0.094139  1.868008
1 -0.076989  1.650014  1.059093 -0.192418
2  0.728413 -1.490116  2.078724  0.264482
0 -1.611903 -0.496911       NaN  0.410460
1  1.202061  0.671499       NaN  0.350244

In [206]:
pd.concat([df1, df2], ignore_index = True)

          a         b         c         d
0 -0.109095  1.095060 -0.094139  1.868008
1 -0.076989  1.650014  1.059093 -0.192418
2  0.728413 -1.490116  2.078724  0.264482
3 -1.611903 -0.496911       NaN  0.410460
4  1.202061  0.671499       NaN  0.350244

In [207]:
# not sure what happened here

## Combining Data with Overlap

In [208]:
# sometimes you may have indexes that overlap in full or part

# in this situation, consider np's 'where' funciton which performs the arr oriented equivalent of an if else
# expression

In [209]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
             index = ['f', 'e', 'd', 'c', 'b', 'a'])

In [210]:
b = pd.Series([0, np.nan, 2., np.nan, np.nan, 5.],
             index = ['a', 'b', 'c', 'd', 'e', 'f'])

In [211]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [212]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [213]:
np.where(pd.isnull(a), b, a)

# if null in a, then b
# else a

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [214]:
# in Series a, if the number is null, the value is from b, else it's from a
# but it's not on an index to index level

# it's looking at each row side by side (why is this a thing)

In [217]:
# series also has a combine_first methodb.combine_first(a)

# does te same as the above operation with pandas usual data alignment logic

In [219]:
b.combine_first(a)  

# get rid of nulls

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [220]:
# with df, combine_first does the same thing column by column so you can think of it as patching missing data

In [221]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                   'b': [np.nan, 2., np.nan, 6.],
                   'c': range(2, 18, 4)})

In [222]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                   'b': [np.nan, 3., 4., 6., 8.]})

In [223]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [224]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [225]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [226]:
# same thing as combine_first but this is a df, not np

## 8.3 Reshaping and Pivoting

In [227]:
# basic ops for rearranging tabular data
# reshape or pivot operations

### Reshaping with Hierarchical Indexing

In [228]:
# Hierarchical indexing provides a consistent way to rearrange data in a df

In [230]:
# there are 2 actions

# stack - rotate or pivots from the columns in the data to the rows

# unstack - this pivots from the rows into the columns

In [234]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index = pd.Index(['Ohio', 'Colorado'], name = 'state'),
                   columns = pd.Index(['one', 'two', 'three'],
                                     name = 'number'))

In [235]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [236]:
# use 'stack' to pivot columns into rows, which makes a series

In [237]:
result = data.stack()

In [238]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [239]:
type(result)

# evrythig else in there is an index

pandas.core.series.Series

In [240]:
# can rearrange with 'unstack'

In [241]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [243]:
# by default the innermost level is unstacked (same with stack)

# you can 'unstack' a different lvl by passing a lvl number or name

In [244]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [245]:
result.unstack('state')

# levels refers to which level of the index. outer index? inner index?

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [246]:
# however unstacking might introduce misisng data if all the values in the level aren't found in each of the subgroups

In [247]:
s1 = pd.Series([0, 1, 2, 3], index = ['a', 'b', 'c', 'd'])

In [249]:
s2 = pd.Series([4, 5, 6], index = ['c', 'd', 'e'])

In [250]:
data2 = pd.concat([s1, s2], keys = ['one', 'two'])

In [251]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [252]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [253]:
# stacking filters out missing data by default so the operation is invertible

In [254]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [255]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [256]:
data2.unstack().stack(dropna = False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [257]:
# when you unstack a df, the level unstacked becomes the lowest level in the result

In [263]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                 columns = pd.Index(['left', 'right'], name = 'side'))

In [264]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [265]:
df.unstack('state')

# if you specify state, state will be the lowest level in the result

# we unstack('state'), oh and cause we unstack by state, state now becomes the columns

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [302]:
# remember levels are only looking at indexes, not at column names. If you want to look at polumn names, you gotta
# pivot or unpivot the df

In [307]:
df.unstack('number')

# and because we unstacked by number, number becomes the columns and now it's the inner (lowest) level

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [308]:
# when calling stack, we can indicate the name of the axis to stack

In [309]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## Pivoting 'Long' to 'Wide' Format

In [310]:
# a way to store multiple time series in a database and csv is called 'long' or 'stacked' format

In [311]:
data = pd.read_csv('examples/macrodata.csv')

In [312]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [313]:
periods = pd.PeriodIndex(year=data.year, quarter = data.quarter, name = 'date')

In [315]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name = 'item')

In [316]:
data = data.reindex(columns = columns)

In [319]:
data.index = periods.to_timestamp('D', 'end')

In [320]:
ldata = data.stack().reset_index().rename(columns = {0: 'value'})

In [321]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [323]:
# the 'long' format with multiple time series, we have 2 keys here (date and item)
# each row represents a single observation

In [324]:
# data is commonly stored this way in relational database like MYSQL

# allows the # of distinct values in the 'item' column to change as data is added to the table

In [327]:
# in the previous example, 'data' and 'item' would be primary and secondary keys (respectively) 

# bu maybe you want to have a df containing one column per distinct 'item' value index by timestamps in the 'date'
# column

In [330]:
pivoted = ldata.pivot('date', 'item', 'value')

In [331]:
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [332]:
# first two values passed are the coulmns to be used respectivley as thhe row and column index, and then an 
# optional value column to fil the df

In [333]:
# suppose you wanted to reshape 2 value columns at the same time

In [336]:
ldata['value2'] = np.random.randn(len(ldata))

In [337]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.616926
1 1959-03-31 23:59:59.999999999     infl     0.000  1.205336
2 1959-03-31 23:59:59.999999999    unemp     5.800 -1.663670
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.829916
4 1959-06-30 23:59:59.999999999     infl     2.340  1.550057
5 1959-06-30 23:59:59.999999999    unemp     5.100 -1.282872
6 1959-09-30 23:59:59.999999999  realgdp  2775.488  1.124379
7 1959-09-30 23:59:59.999999999     infl     2.740  1.817871
8 1959-09-30 23:59:59.999999999    unemp     5.300  2.060402
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  0.334002

In [338]:
len(ldata)

609

In [339]:
# by omitting the last arg, you obtain a df with hiearchical columns

In [340]:
pivoted = ldata.pivot('date', 'item')

In [342]:
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  1.205336  0.616926
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  1.550057 -0.829916
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.817871  1.124379
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.698108  0.334002
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.178982  0.233651


item                              unemp
date
1959-03-31 23:59:59.999999999 -1.663670
1959-06-30 23:59:59.999999999 -1.282872
1959-09-30 23:59:59.999999999  2.060402
1959-12-31 23:59:59.999999999  1.096203
1960-03-31 23:59:59.999999999 -1.331727

In [343]:
# 'pivot' is equal to create a hiearchical index using set_index followed by 'unstack'

In [344]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')

In [345]:
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  1.205336  0.616926
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  1.550057 -0.829916
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.817871  1.124379
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.698108  0.334002
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.178982  0.233651
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2  1.156279  1.039641
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6  0.515838  0.616427


item                              unemp
date
1959-03-31 23:59:59.999999999 -1.663670
1959-06-30 23:59:59.999999999 -1.282872
1959-09-30 23:59:59.999999999  2.060402
1959-12-31 23:59:59.999999999  1.096203
1960-03-31 23:59:59.999999999 -1.331727
1960-06-30 23:59:59.999999999 -0.931443
1960-09-30 23:59:59.999999999  0.075923

## Pivoting 'Wide' to 'Long' Format

In [346]:
# inverse of 'pivot' for df is pandas.melt

# merges multiple columns into one, producing a df that is longer than the input

In [347]:
df = pd.DataFrame({'key':['foo', 'bar', 'baz'],
                  'A': [1, 2, 3],
                  'B': [4, 5, 6], 
                  'C': [7, 8, 9]})

In [348]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [349]:
# 'key' column is a group indicater and the other coluns are data values

# when using pandas.melt, we must indicate which columns (if any) are group indicators

# let's use 'key' as the only group indicator here

In [350]:
melted = pd.melt(df, ['key'])

In [351]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [352]:
# can use 'pivot' to reshape back to original layout

In [353]:
reshaped = melted.pivot('key', 'variable', 'value')

In [354]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [355]:
# the pivot result creates an index from the column used as the row labels, use reset_index to move data back
# inot a column

In [356]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [357]:
# can specify a subset of columns to use as value columns

In [358]:
pd.melt(df, id_vars = ['key'], value_vars = ['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [359]:
# pandas.melt can be used w/o any group identifiers too

SyntaxError: invalid syntax (<ipython-input-359-cc9439421ef1>, line 1)

In [360]:
pd.melt(df, value_vars = ['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [361]:
pd.melt(df, value_vars = ['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6